Resources/schemas/Wsdl/New_Zealand_Inland_Revenue_Reporting_for_Payroll - NewWSDLFile.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:i0="https://www.ird.govt.nz/GWS" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="https://services.ird.govt.nz/GWS/Returns/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ei="urn:www.ird.govt.nz/GWS:types/ReturnEI.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1" name="Return" targetNamespace="https://services.ird.govt.nz/GWS/Returns/">
	<wsdl:types>
		<xs:schema elementFormDefault="qualified"
			targetNamespace="https://services.ird.govt.nz/GWS/Returns/"
			xmlns:xs="http://www.w3.org/2001/XMLSchema">
			<xs:element name="File">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="1" name="ReturnFileRequestMsg" nillable="true"
							type="q1:FileRequestType"
							xmlns:q1="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="FileResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="FileResult" nillable="true"
							type="q2:FileResponseType"
							xmlns:q2="https://services.ird.govt.nz/GWS/Returns/:types/FileResponse"
						/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
		</xs:schema>
		<xs:schema attributeFormDefault="qualified" elementFormDefault="qualified"
			targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/"
			xmlns:xs="http://www.w3.org/2001/XMLSchema"
			xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
			<xs:element name="anyType" nillable="true" type="xs:anyType"/>
			<xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
			<xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
			<xs:element name="boolean" nillable="true" type="xs:boolean"/>
			<xs:element name="byte" nillable="true" type="xs:byte"/>
			<xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
			<xs:element name="decimal" nillable="true" type="xs:decimal"/>
			<xs:element name="double" nillable="true" type="xs:double"/>
			<xs:element name="float" nillable="true" type="xs:float"/>
			<xs:element name="int" nillable="true" type="xs:int"/>
			<xs:element name="long" nillable="true" type="xs:long"/>
			<xs:element name="QName" nillable="true" type="xs:QName"/>
			<xs:element name="short" nillable="true" type="xs:short"/>
			<xs:element name="string" nillable="true" type="xs:string"/>
			<xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
			<xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
			<xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
			<xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
			<xs:element name="char" nillable="true" type="tns:char"/>
			<xs:simpleType name="char">
				<xs:restriction base="xs:int"/>
			</xs:simpleType>
			<xs:element name="duration" nillable="true" type="tns:duration"/>
			<xs:simpleType name="duration">
				<xs:restriction base="xs:duration">
					<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
					<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
					<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:element name="guid" nillable="true" type="tns:guid"/>
			<xs:simpleType name="guid">
				<xs:restriction base="xs:string">
					<xs:pattern
						value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"
					/>
				</xs:restriction>
			</xs:simpleType>
			<xs:attribute name="FactoryType" type="xs:QName"/>
			<xs:attribute name="Id" type="xs:ID"/>
			<xs:attribute name="Ref" type="xs:IDREF"/>
		</xs:schema>
		<xs:schema elementFormDefault="qualified"
			targetNamespace="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest"
			xmlns:xs="http://www.w3.org/2001/XMLSchema"
			xmlns:tns="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/ReturnEI.v1"
				schemaLocation="ReturnEI.v1.xsd"/>
			<xs:complexType name="FileRequestType">
				<xs:sequence>
					<xs:element name="FileRequestWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="ei:fileRequest"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="FileRequestType" nillable="true" type="tns:FileRequestType"/>
		</xs:schema>
		<xs:schema elementFormDefault="qualified"
			targetNamespace="https://services.ird.govt.nz/GWS/Returns/:types/FileResponse"
			xmlns:xs="http://www.w3.org/2001/XMLSchema"
			xmlns:tns="https://services.ird.govt.nz/GWS/Returns/:types/FileResponse">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v1"
				schemaLocation="ReturnCommon.v1.xsd"/>
			<xs:complexType name="FileResponseType">
				<xs:sequence>
					<xs:element name="FileResponseWrapper" nillable="true">
						<xs:complexType>
							<xs:sequence>
								<xs:element ref="rc:fileResponse"/>
							</xs:sequence>
						</xs:complexType>
					</xs:element>
				</xs:sequence>
			</xs:complexType>
			<xs:element name="FileResponseType" nillable="true" type="tns:FileResponseType"/>
		</xs:schema>








	</wsdl:types>
	<wsdl:message name="Return_File_InputMessage">
		<wsdl:part name="parameters" element="tns:File"/>
	</wsdl:message>
	<wsdl:message name="Return_File_OutputMessage">
		<wsdl:part name="parameters" element="tns:FileResponse"/>
	</wsdl:message>
	
	
	
	
	
	
	
	
	<wsdl:portType name="Return">
		<wsdl:documentation>This Returns service can be utilised for a number of returns tasks. For information regarding the proper use of this service, schemas, formatting of request and response types please refer to the Returns build pack provided during onboarding.</wsdl:documentation>
		<wsdl:operation name="File">
			<wsdl:documentation>
				<summary>The ReturnFile operation allows the filing of several different return types. Reference Returns payloads namespace www.ird.govt.nz/GWS and provided at http://www.ird.govt.nz/software-developers/</summary>
				<returns>ReturnFileResponse will contain a status and error message. See schema for more details.</returns>
				<param name="ReturnFileRequestMsg">ReturnFileRequest will contain the return specific fields in XML format. See return specific schema for more details.</param>
			</wsdl:documentation>
			<wsdl:input message="tns:Return_File_InputMessage" wsam:Action="https://services.ird.govt.nz/GWS/Returns/Return/File"/>
			<wsdl:output message="tns:Return_File_OutputMessage" wsam:Action="https://services.ird.govt.nz/GWS/Returns/Return/FileResponse"/>
		</wsdl:operation>
		
		
		
		
	</wsdl:portType>
	<wsdl:binding name="WSHttpBinding_Return" type="tns:Return">
		<soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsp:PolicyReference URI="#WSHttpBinding_Return_policy"/>
		<wsdl:operation name="File">
			<soap12:operation soapAction="https://services.ird.govt.nz/GWS/Returns/Return/File" style="document"/>
			<wsdl:input>
				<soap12:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap12:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		
		
		
		
	</wsdl:binding>
	<wsdl:service name="Return">
		<wsdl:port name="WSHttpBinding_Return" binding="tns:WSHttpBinding_Return">
			<soap12:address location="http://localhost/WebServices/Gateway/GWS/Returns"/>
			<wsa10:EndpointReference>
				<wsa10:Address>http://localhost/WebServices/Gateway/GWS/Returns</wsa10:Address>
			</wsa10:EndpointReference>
		</wsdl:port>
	</wsdl:service>
	<wsp:Policy wsu:Id="WSHttpBinding_Return_policy">
		<wsp:ExactlyOne>
			<wsp:All>
				<wsam:Addressing>
					<wsp:Policy>
						<wsam:AnonymousResponses/>
					</wsp:Policy>
				</wsam:Addressing>
			</wsp:All>
		</wsp:ExactlyOne>
	</wsp:Policy>
</wsdl:definitions>
